Repository: OSM-es/CatAtom2Osm
Catalog: locale/po/*/LC_MESSAGES/catatom2osm.po
Languages: es

source: catatom2osm [OPTION]... [PATHS] The argument PATHS states for directories to process municipalities. The last directory in each path shall be 5 digits (GGMMM) matching the Cadastral codes for Provincial Office (GG) and Municipality (MMM). If the program don't find the input files it will download them for you from the INSPIRE Services of the Spanish Cadastre.
es: catatom2osm [OPCIÓN]... [PATHS] El argumento PATHS indica los directorios para procesar municipios. El nombre del último directorio en cada ruta debe ser 5 dígitos (GGMMM) correspondientes al código de Oficina Provincial (GG) y Municipio (MMM). Si el programa no encuentra los archivos de entrada los descargará de los Servicios INSPIRE del Catastro Español.

source: Examples: catatom2osm 05015 Process a municipality. 05015/highway_names.csv is generated. You need to correct it following the wiki and process a second time. https://openstreetmap.es/catastro [Projects management]. catatom2osm -l List province codes. catatom2osm -l 05 List municipality codes in province 05 Ávila. catatom2osm -b 05015 Process only buildings (without addresses). catatom2osm -s Atocha.geojson 28900 It processes the Atocha neighborhood delimited by a geojson file with its administrative limit. Pass only the zones that have more than 50% of their area within the limit. catatom2osm -l 28900 List OSM administrative boundaries available in Madrid catatom2osm -s Atocha 28900 Downloads administrative boundary of Atocha neighborhood in Madrid and process it.
es: Ejemplos: catatom2osm 05015 Procesa un municipio. Se genera 05015/highway_names.csv. Es necesario corregirlo siguiendo la wiki y procesar una segunda vez. https://openstreetmap.es/catastro [Gestión de proyectos] catatom2osm -l Lista los códigos provinciales. catatom2osm -l 05 Lista los códigos de municipio en la provincia 05 Ávila. catatom2osm -b 05015 Procesa sólo los edificios (sin direcciones). catatom2osm -l 28900 Lista los límites administrativos disponibles para Madrid en OSM. catatom2osm -s Atocha.geojson 28900 Procesa el barrio de Atocha delimitado por un archivo geojson con su límite administrativo. Entran las zonas que tengan más de un 50% de su área dentro del límite. catatom2osm -s Atocha.geojson 28900 Descarga los límites administrativos del barrio de Atocha en Madrid y lo procesa.

source: Directories for input and output files
es: Directorios para los archivos de entrada y salida.

source: Show program's version number and exit
es: Muestra la versión del programa y sale

source: List province codes or municipality codes for PROV (2 digits) or administrative boundaries for MUN (5 digits)
es: Lista códigos de provincia o de municipios en PROV (2 dígitos) o límites administrativos para MUN (5 dígitos)

source: Process only the building dataset
es: Procesa sólo el conjunto de datos de edificios

source: Process only the address dataset
es: Procesa sólo el conjunto de datos de direcciones

source: Process only the tasks definition file
es: Procesa sólo el archivo de definición de tareas

source: Process data in the parcels delimited by SPLIT (file / administrative boundary OSM id or name)
es: Procesa los datos en las zonas delimitadas por SPLIT (archivo / id OSM o nombre del límite administrativo)

source: Disable conflation with OSM data
es: Desactiva la combinación con datos de OSM

source: Recovers the metadata of the tasks
es: Recupera los metadatos de las tareas

source: Download only
es: Solo descargar

source: Download and get dataset information
es: Descargar y obtener información del conjunto de datos

source: Select the log level between DEBUG, INFO, WARNING, ERROR or CRITICAL.
es: Selecciona el nivel de registro entre DEBUG, INFO, WARNING, ERROR o CRITICAL.

source: Path to the user configuration file. Defaults to '%s'
es: Ruta al archivo de configuración. Por defecto es '%s'

source: Output a sample config file with the default user configuration
es: Genera un archivo de muestra con la configuración por defecto

source: Can't use split file with multiple municipalities
es: No se pueden usar archivo de límites para varios municipios

source: Initialized QGIS %s API
es: Inicializada la API de QGIS %s

source: Using GDAL %s
es: Usando GDAL %s

source: Resume processing '%s'
es: Reanuda el procesado de '%s'

source: Start processing '%s'
es: Comienza el procesado de '%s'

source: Administrative boundary: '%s'
es: División administrativa: '%s

source: Split: '%s'
es: División: '%s'

source: No report found
es: No se ha encontrado 'report.txt'

source: Check %d fixme tags
es: Revisa %d etiquetas fixme

source: No tasks found
es: No hay tareas

source: '%s' does not include any polygon
es: '%s' no incluye ninguna polígono

source: Parcel '%s' does not exists
es: La parcela '%s' no existe

source: No parcels data
es: No hay parcelas

source: No buildings data
es: No hay edificios

source: Removed %d void parcels
es: Eliminadas %d parcelas vacías

source: Conflict with %d existing tasks
es: Conflicto con %d tareas existentes

source: Generated %d rustic and %d urban tasks files
es: Generados %d archivos de tareas de rústica y %d de urbana

source: Municipality: '%s'
es: Municipio: '%s'

source: Generated '%s'
es: Generado '%s'

source: Please, check it before publish
es: Por favor, compruébelo antes de publicar

source: Finished!
es: ¡Terminado!

source: Could not resolve joined tables for the '%s' layer
es: No se pudieron resolver las tablas combinadas para la capa '%s'

source: No addresses data
es: No hay direcciones

source: Deleted %d addresses refused by street name
es: Eliminadas %d direcciones rechazadas por nombre de vial

source: Please, check it and run again
es: Por favor, compruébelo y ejecute de nuevo

source: Refused %d 'parcel' addresses not unique for it building
es: Rechazadas %d direcciones tipo parcela no únicas para su edificio

source: There are %d address without house number in the OSM data
es: Existen %d direcciones sin número de portal en OSM

source: Failed to write layer: '%s'
es: Error al escribir la capa: '%s'

source: Downloading '%s'
es: Descargando '%s'

source: No OSM data were obtained from '%s'
es: No se obtuvieron datos OSM de '%s'

source: Read '%s': %d nodes, %d ways, %d relations
es: Leído '%s': %d nodos, %d vías, %d relaciones

source: Generated '%s': %d nodes, %d ways, %d relations
es: Generado '%s': %d nodos, %d vías, %d relaciones

source: Territorial office
es: Oficina territorial

source: Province code '%s' is not valid
es: El Código Provincial '%s' no es válido

source: Territorial office %s - %s
es: Oficina territorial %s - %s

source: District
es: Distrito

source: Ward
es: Barrio

source: Municipality code '%s' don't exists
es: El código de municipio '%s' no existe

source: Last directory name must be a 5 digits ZIP code
es: El nombre del último directorio debe ser un código de municipio de 5 dígitos

source: Not a directory: '%s'
es: No es un directorio: '%s'

source: Could not read metadata from '%s'
es: No se pueden leer los metadatos de '%s'

source: Searching the url for the '%s' layer of '%s'...
es: Buscando la url para la capa '%s' de '%s'...

source: Unknown layer name '%s'
es: El nombre de capa '%s' es desconocido

source: The layer '%s' is empty
es: La capa '%s' está vacía

source: Failed to load layer '%s'
es: Error al cargar la capa: '%s'

source: Could not determine the CRS of '%s'
es: No se puede determinar el CRS de '%s'

source: Read %d features in '%s'
es: Leídos %d características en '%s'

source: Parsed %d addresses from '%s'
es: Analizadas %d direcciones de '%s'

source: Replaced %d addresses from '%s'
es: Reemplazadas %d direcciones de '%s'

source: Added %d addresses from '%s'
es: Añadidas %d direcciones de '%s'

source: # language: # Language to translate thoroughfare names: es_ES ca_ES gl_ES # highway_types: # Dictionary to translate thoroughfare types # place_types: # List of highway types to translate as place addresses (addr:place) # remove_place_from_name: # List of highway types to remove from the name # excluded_types # List of highway types not to be parsed # warning_min_area: # Area in m² for small area warning # warning_max_area: # Area in m² for big area warning # parcel_parts: # Number of building parts to agregate parcels # parcel_dist: # Distance in meters to agregate parcels
es: # language: # Idioma para traducir los nombres de viales: es_ES ca_ES gl_ES # highway_types: # Diccionario para traducir los tipos de vias # place_types: # lista de tipos de vía que se traducen a direcciones de lugar (addr:place) # remove_place_from_name: # Lista de tipos de vía a eliminar del nombre # excluded_types # Lista de tipos de vía que no se analizarán # warning_min_area: # Área en m² para el aviso de área pequeña # warning_max_area: # Área en m² para el aviso de área grande # parcel_parts: # Número de partes de edificio para agregar parcelas # parcel_dist: # Distancia en metros para agregar parcelas

source: Config file '%s' exists. Delete it if you want to overwrite.
es: El fichero de configuración '%s' existe. Bórralo si quieres sobreescribirlo.

source: Config file saved as '%s'
es: Fichero de configuración guardado como '%s'

source: Couldn't save the sample config file
es: No se pudo grabar el fichero de configuración

source: Can't read '%s'
es: No se pudo leer '%s'

source: Config file '%s' not found
es: Fichero de configuración '%s' no encontrado

source: Failed to load CSV file '%s'
es: Error al cargar el archivo CSV '%s'

source: Downloading
es: Descargando

source: The geometry of zone '%s' is not valid
es: La geometría de la zona '%s' no es válida

source: Refused %d addresses because they exist in OSM
es: Rechazadas %d direcciones por existir en OSM

source: Deleted %d addresses without house number
es: Eliminadas %d direcciones sin número de portal

source: Removed %d addresses without building
es: Eliminadas %d direcciones sin edificio asociado

source: Error when creating shapefile: '%s'
es: Error al crear el archivo shapefile: '%s'

source: Append
es: Agregar

source: Loaded %d features in '%s' from '%s'
es: Cargados %d características en '%s' desde '%s'

source: Reproject
es: Reproyectar

source: Reprojected the '%s' layer to '%s' CRS
es: Reproyectada la capa '%s' al CRS '%s'

source: Join field
es: Unir campo

source: Joined '%s' to '%s'
es: Combinado '%s' a '%s'

source: Detected a %s geometry in the '%s' layer
es: Detectada una geometría %s en la capa '%s'

source: Loaded %d nodes, %d ways, %d relations from '%s' layer
es: Cargados %d nodos, %d vías, %d relaciones de la capa '%s'

source: Removed %d parts without building
es: Eliminadas %d partes sin edificios

source: Remove outside parts
es: Eliminar partes exteriores

source: Removed %d building parts outside the outline
es: Eliminadas %d partes de edificio fuera del contorno

source: Deleted %d building parts with no floors above ground
es: Eliminadas %d partes de edificio sin plantas sobre el nivel del suelo

source: This part is bigger than its building
es: Esta parte es mayor que su edificio

source: Building parts don't fill the building outline
es: Las partes de edificio no cubren todo el contorno

source: Merge building parts
es: Combinar partes de edificios

source: Located %d swimming pools over a building
es: Localizadas %d piscinas sobre un edificio

source: Deleted %d buildings coincidents with a swimming pool
es: Eliminados %d edificios conicidentes con una piscina

source: Translated %d level values to the outline
es: Trasladados %d valores de niveles al contorno

source: Merged %d building parts to the outline
es: Fusionados %d partes de edificios al contorno

source: Merged %d adjacent parts
es: Fusionadas %d partes adyacentes

source: Move addresses
es: Mover direcciones

source: Moved %d addresses to entrance, %d specification changed
es: Desplazadas %d direcciones a entrada, %d cambiadas de especificación

source: Deleted %d addresses without associated building
es: Eliminadas %d direcciones sin edificio asociado

source: Refused %d addresses belonging to multiple buildings
es: Eliminadas %d direcciones pertenecientes a edificios múltiples

source: GEOS validation
es: Validación GEOS

source: Check, area too small
es: Comprobar, área demasiado pequeña

source: Check, area too big
es: Comprobar, área demasiado grande

source: Conflate
es: Combinación

source: OSM building with id %s is not valid
es: El edificio de OSM con id %s no es válido

source: Detected %d conflicts in %d buildings/pools from OSM
es: Detectados %d edificios/piscinas con conflicto de %d en OSM

source: Added %d missing parcels
es: Añadidas %d parcelas perdidas

source: Assigned %d zones from %s to parcels
es: Asginadas %d zonas desde %s a parcelas

source: Rustic
es: Rústica

source: Urban
es: Urbana

source: There are %d parcels without zone
es: Existen %d parcelas sin zona

source: Explode multi parts
es: Separar geometrías multiparte

source: %d multi-polygons splitted into %d polygons in the '%s' layer
es: %d multipolígonos divididos a %d poligonos en la capa '%s'

source: Topology
es: Topología

source: Merged %d close vertices in the '%s' layer
es: Fusionados %d vértices próximos en la capa '%s'

source: Created %d topological points in the '%s' layer
es: Creados %d puntos topológicos en la capa '%s'

source: Deleted %d invalid geometries in the '%s' layer
es: Eliminadas %d geometrías no válidas en la capa '%s'

source: Delete invalid geometries
es: Eliminar geometrías no válidas

source: Deleted %d invalid part geometries in the '%s' layer
es: Eliminadas %d partes no válidas de geometrías en la capa '%s'

source: Deleted %d invalid ring geometries in the '%s' layer
es: Eliminados %d anillos de geometrías no válidos en la capa '%s'

source: Deleted %d zig-zag vertices in the '%s' layer
es: Eliminados %d vértices en zig-zag en la capa '%s'

source: Deleted %d spike vertices in the '%s' layer
es: Fusionados %d vértices en punta en la capa '%s'

source: Simplify
es: Simplificar

source: Simplified %d vertices in the '%s' layer
es: Simplificados %d vértices en la capa '%s'

source: %d polygons merged into %d polygons in '%s'
es: %d polígonos fusionados a %d polígonos en la capa '%s'

source: Difference
es: Diferencia

source: Municipality
es: Municipio

source: Cadastre name
es: Nombre en Catastro

source: Code
es: Código

source: Split ID
es: División (identificador OSM)

source: Split name
es: División (nombre)

source: Split file
es: División (archivo)

source: Date
es: Fecha

source: Options
es: Opciones

source: Language
es: Idioma

source: System info
es: Información del sistema

source: Application version
es: Versión de la aplicación

source: Platform
es: Plataforma

source: QGIS version
es: Versión de QGIS

source: GDAL version
es: Versión de GDAL

source: CPU count
es: Número de CPUs

source: CPU frequency
es: Frecuencia de CPU

source: Execution time
es: Tiempo de ejecución

source: Total memory
es: Memoria total

source: Physical memory usage
es: Memoria física usada

source: Virtual memory usage
es: Memoria virtual usada

source: Addresses
es: Direcciones

source: Feature count
es: Número de características

source: Replaced addresses
es: Direcciones reemplazadas

source: Added addresses
es: Direcciones añadidas

source: Input data
es: Datos de entrada

source: Source date
es: Fecha de origen

source: Type entrance
es: Tipo entrada

source: Type parcel
es: Tipo parcela

source: Postal codes
es: Códigos postales

source: Street names
es: Nombres de viales

source: Process
es: Procesado

source: Addresses without associated building excluded
es: Direcciones sin edificio asociado excluidas

source: Addresses deleted by street name
es: Direcciones eliminadas por nombre de vía

source: Addresses without house number deleted
es: Direcciones sin número de portal eliminadas

source: Addresses belonging to multiple buildings deleted
es: Direcciones correspondientes a edificios múltiples eliminadas

source: 'Parcel' addresses not unique for its building deleted
es: Direcciones tipo parcela no únicas para su edificio eliminadas

source: Conflation
es: Combinación

source: OSM addresses
es: Direcciones OSM

source: Without house number
es: Sin número de portal

source: Addresses rejected because they exist in OSM
es: Direcciones rechazadas por existir en OSM

source: Output data
es: Datos de salida

source: In entrance nodes
es: En nodos de entrada

source: In parcels
es: En parcelas

source: Type addr:street
es: Tipo addr:street

source: Type addr:place
es: Tipo addr:place

source: Buildings
es: Edificios

source: Building parts
es: Partes de edificios

source: Swimming pools
es: Piscinas

source: Parts without associated building excluded
es: Direcciones sin edificio asociado excluidas

source: Parts without building deleted
es: Partes sin edificio asociado eliminadas

source: Parts outside outline deleted
es: Partes fuera de contorno eliminadas

source: Parts with no floors above ground
es: Partes bajo rasante eliminadas

source: Buildings with multipart geometries
es: Edificios con geometrías multiparte

source: Buildings resulting from splitting multiparts
es: Edificios resultantes de dividir multipartes

source: Parts merged to the outline
es: Partes fusionadas al contorno

source: Adjacent parts merged
es: Partes adyacentes fusionadas

source: Buildings coincidents with a swimming pool deleted
es: Edificios conincidentes con una piscina eliminados

source: Invalid geometry parts deleted
es: Partes no válidas de geometrías eliminadas

source: Invalid geometry rings deleted
es: Anillos de geometrías no válidos eliminados

source: Invalid geometries deleted
es: Geometrías no válidas eliminadas

source: Zig-zag vertices deleted
es: Vértices en zig-zag eliminados

source: Spike vertices deleted
es: Vértices en punta eliminados

source: Close vertices merged
es: Vértices próximos fusionados

source: Topological points created
es: Puntos topológicos creados

source: Simplified vertices
es: Vértices simplificados

source: Buildings/pools in OSM
es: Edificios/piscinas en OSM

source: With conflict
es: Con conflicto

source: Nodes
es: Nodos

source: Ways
es: Vías

source: Relations
es: Relaciones

source: Buildings parts
es: Partes de edificios

source: Over buildings
es: Sobre edificios

source: Building types counter
es: Recuento de tipos de edificios

source: Max. levels above ground (level: # of buildings)
es: Plantas sobre rasante (nivel: nº de edificios)

source: Min. levels below ground (level: # of buildings)
es: Plantas bajo rasante (nivel: nº de edificios)

source: Project
es: Proyecto

source: Building parts threshold
es: Umbral de partes de edificios

source: Distance threshold
es: Umbral de distancia

source: Tasks files
es: Archivos de tareas

source: Problems
es: Problemas

source: Report validation:
es: Validación del informe:

source: Fixmes
es: Correcciones (fixmes)

source: Warnings:
es: Avisos:

source: seconds
es: segundos

source: Sum of rustic and urban tasks should be equal to number of tasks in the project
es: La suma de tareas de urbana y rústica debe ser igual al número de tareas del proyecto

source: Sum of address types should be equal to the input addresses
es: La suma de tipos de direcciones debe ser igual a las direcciones de entrada

source: Sum of output and deleted addresses should be equal to the input addresses
es: La suma de las direcciones de salida y las eliminadas debe ser igual a las direcciones de entrada

source: Sum of entrance and parcel addresses should be equal to output addresses
es: La suma de las direcciones tipo entrada y parcela debe ser igual a las direcciones de salida

source: Sum of street and place addresses should be equal to output addresses
es: La suma de las direcciones tipo calle y lugar debe ser igual a las direcciones de salida

source: Sum of buildings, parts and pools should be equal to the feature count
es: La suma de edificios, partes y piscinas debe ser igual al número de características

source: Sum of output and deleted minus created building features should be equal to input features
es: La suma de las características de edificios de salida y las eliminadas menos las creadas debe ser igual a las características de entrada

source: Sum of building types should be equal to the number of buildings
es: La suma de los tipos de edificios debe ser igual al número de edificios
